<?php
return array(
	//Model
	//
	//模型定义
	//
	'/([{};,(=\s\.])消息模型([\s\'\"\(-;])/i'=>'$1M("Chat")$2',
	'/([{};,(=\s\.])消息统计模型([\s\'\"\(-;])/i'=>'$1M("Chat_count")$2',
	'/([{};,(=\s\.])统计模型([\s\'\"\(-;])/i'=>'$1M("Count")$2',
	'/([{};,(=\s\.])文件模型([\s\'\"\(-;])/i'=>'$1M("File")$2',
	'/([{};,(=\s\.])文件信息模型([\s\'\"\(-;])/i'=>'$1M("Fileinfo")$2',
	'/([{};,(=\s\.])分类模型([\s\'\"\(-;])/i'=>'$1M("Forum")$2',
	'/([{};,(=\s\.])朋友模型([\s\'\"\(-;])/i'=>'$1M("Friend")$2',
	'/([{};,(=\s\.])在线模型([\s\'\"\(-;])/i'=>'$1M("Ol")$2',
	'/([{};,(=\s\.])评论模型([\s\'\"\(-;])/i'=>'$1M("Post")$2',
	'/([{};,(=\s\.])帖子模型([\s\'\"\(-;])/i'=>'$1M("Thread")$2',
	'/([{};,(=\s.])用户模型([\s\'\"\(-;])/i'=>'$1M("User")$2',
	'/([{};,(=\s\.])用户组模型([\s\'\"\(-;])/i'=>'$1M("Usergroup")$2',
	'/([{};,(=\s\.])数据缓存([\s\'\"\(-;])/i'=>'$1$this->CacheObj$2',
	//共用
	//'/([)\s]+)->(.*)发送聊天信息([\s\(]+)/i'=>'->$1send$2',
	//
	//
	//Chat
	'/->(.*)发送聊天信息([\s\(]+)/i'=>'->$1send$2',
	'/->(.*)发送系统信息([\s\(]+)/i'=>'->$1sys_send$2',

	//Chat_count
	'/->(.*)获取未读消息数量([\s\(]+)/i'=>'->$1get_c$2',

	//Friend
	'/->(.*)获取两者关系([\s\(]+)/i'=>'->$1get_state$2',
	'/->(.*)添加关注([\s\(]+)/i'=>'->$1add_friend$2',
	'/->(.*)删除关注([\s\(]+)/i'=>'->$1rm_friend$2',
	'/->(.*)获取对象未读消息数量([\s\(]+)/i'=>'->$1rm_friend$2',

	//Post
	'/->(.*)删除评论([\s\(]+)/i'=>'->$1del$2',

	//Thread
	'/->(.*)获取标题([\s\(]+)/i'=>'->$1get_title$2',
	'/->(.*)删除帖子([\s\(]+)/i'=>'->$1del$2',
	'/->(.*)获取主题列表([\s\(]+)/i'=>'->$1read_list$2',
	'/->(.*)搜索主题列表([\s\(]+)/i'=>'->$1search_list$2',
	'/->(.*)判断用户是否回复过该主题([\s\(]+)/i'=>'->$1is_user_post$2',

	//User
	'/->(.*)用户名获取数据([\s\(]+)/i'=>'->$1user_read$2',
	'/->(.*)UID获取数据([\s\(]+)/i'=>'->$1read$2',
	'/->(.*)邮箱获取数据([\s\(]+)/i'=>'->$1email_read$2',
	'/->(.*)判断是否存在UID([\s\(]+)/i'=>'->$1is_id$2',
	'/->(.*)是否存在用户名([\s\(]+)/i'=>'->$1is_user$2',
	'/->(.*)是否存在邮箱([\s\(]+)/i'=>'->$1is_email$2',
	'/->(.*)添加账号([\s\(]+)/i'=>'->$1add_user$2',
	'/->(.*)UID转用户名([\s\(]+)/i'=>'->$1id_to_user$2',
	'/->(.*)用户名转UID([\s\(]+)/i'=>'->$1user_to_id$2',
	'/->(.*)获取用户头像([\s\(]+)/i'=>'->$1avatar$2',
	'/->(.*)获取用户金币([\s\(]+)/i'=>'->$1get_gold$2',
	'/->(.*)获取用户积分([\s\(]+)/i'=>'->$1get_credits$2',
	'/->(.*)设置用户组([\s\(]+)/i'=>'->$1set_group$2',
	'/->(.*)获取用户组([\s\(]+)/i'=>'->$1get_group$2',
	'/->(.*)获取粉丝数量([\s\(]+)/i'=>'->$1get_fans$2',
	'/->(.*)获取关注数量([\s\(]+)/i'=>'->$1get_follow$2',

	//Usergroup
	'/->(.*)GID转用户组名称([\s\(]+)/i'=>'->$1id_to_name$2',

	//Forum
	'/->(.*)获取所有板块数据([\s\(]+)/i'=>'->$1read_all$2',
	'/->(.*)获取板块数据([\s\(]+)/i'=>'->$1read$2',
	'/->(.*)判断用户组板块权限([\s\(]+)/i'=>'->$1is_comp$2',


	//Lib Function
	//
	

	//数据缓存
	'/->(.*)获取([\s\(]+)/i'=>'->$1get$2',
	'/->(.*)设置([\s\(]+)/i'=>'->$1set$2',
	'/->(.*)删除([\s\(]+)/i'=>'->$1rm$2',
	'/->(.*)清空([\s\(]+)/i'=>'->$1clear$2',
	

);