<?php
return array(
	//注册页面
	'注册'=>'注册',
	'用户注册'=>'注册账号',
	'账户'=>'账户',
	'邮箱'=>'邮箱',
	'密码'=>'密码',
	'确认密码'=>'确认密码',
	'注 册'=>'注 册',
	'已有账号登录'=>'已有账户? 点击登录',
	'注册成功'=>'注册成功',
	'注册失败'=>'注册失败',

	//登录页面
	'登录'=>'登录',
	'用户登录'=>'用户登录',
	'忘记密码'=>'忘记密码',
	'登录成功'=>'登录成功',
	'登录失败'=>'登录失败',
	'跳转注册'=>'跳转注册',

	//找回密码页面
	'邮箱验证码'=>'邮箱验证码',
	'点击获取验证码'=>'点击获取验证码',
	'注册所填邮箱'=>'注册账号时所填写的邮箱地址',
	'邮箱验证码'=>'邮箱验证码',
	'新密码'=>'新密码',
	'提交修改'=>'提交更改',
	'返回登录'=>'返回登录',
	'发送成功'=>'发送成功',
	'请到你的'=>'请到你的',
	'查看验证码'=>'查看验证码',
	'可能垃圾邮件'=>'可能验证码邮件被邮箱服务器放入垃圾箱中',
	'发送失败'=>'发送失败',
	'服务器繁忙'=>'服务器繁忙',
	'修改成功'=>'修改成功',
	'修改失败'=>'修改失败',
	'密码修改成功'=>'密码修改成功!',


	//用户主页
	'用户中心'=>'用户中心',
	'文章作品'=>'文章作品',
	'查看更多'=>'查看更多',
	'我的收藏'=>'我的收藏',
	'我的金钱'=>'我的金钱',
	'评论留言'=>'评论留言',
	'最近发布'=>'最近发布',
	'最近评论'=>'最近评论',
	'快捷菜单'=>'快捷菜单',
	'聊天'=>'聊天',
	'取消关注'=>'取消关注',
	'关注'=>'关注',
	'网站首页'=>'网站首页',
	'发布文章'=>'发布文章',
	'我的文件'=>'我的文件',
	'修改资料'=>'修改资料',
	'注销登录'=>'注销登录',
	'失败'=>'失败',
	'请尝试重新提交'=>'请尝试重新提交',


	//Left Menu
	'关注数量'=>'关注',
	'粉丝数量'=>'粉丝',
	'文章数量'=>'文章',
	'首页中心'=>'首页中心',
	'我的文章'=>'我的文章',
	'帖子评论'=>'帖子评论',
	'编辑资料'=>'编辑资料',
	'我的文件'=>'我的文件',
	'返回网站首页'=>'返回网站首页',
	'管理后台'=>'管理后台',
	

	//File page
	'所有文件'=>'所有文件',
	'曾上传过的所有文件'=>'曾上传过的所有文件',
	'附件列表'=>'附件列表',
	'曾上传在文章的附件'=>'曾上传在文章的附件',
	'附件名'=>'附件名',
	'文件大小'=>'文件大小',
	'上传时间'=>'上传时间',

	//Edit Data
	'个人资料'=>'个人资料',
	//请如实填写以下内容，让大家更好的交流互动
	'个人资料介绍'=>'个人资料介绍',
	'来'=>'来',
	'已经'=>'已经',
	'天了'=>' 天了',
	'用户名'=>'用户名',
	'个人说明'=>'个人说明',
	'修改资料'=>'修改资料',
	'个性签名'=>'个性签名',
	'最大支持40个字符'=>'最大支持40个字符',
	'保存资料'=>'保存资料',
	'修改头像'=>'修改头像',
	'头像'=>'头像',
	'选择头像文件'=>'选择头像文件',
	'上传头像'=>'上传头像',
	'账号安全'=>'账号安全',

	//
	'新密码提示'=>'如果您想修改您的密码，请在此输入新密码。不然请留空。.',
	'新密码提示A'=>'请确认新密码',

	//Post
	'您已发表'=>'您已发表',
	'条评论'=>'条评论.',
	'发表在'=>'发表在',
	'上一页'=>'上一页',
	'下一页'=>'下一页',

	//Thread
	'您已发布'=>'您已发布',
	'篇文章作品'=>'篇文章作品',
	'写文章'=>'写文章',
	'图片数量'=>'图片数量',
	'附件数量'=>'附件数量',
	'评论数量'=>'评论数量',

	


	


);